Revit 2026 API

# CoordinatePlaneVisibility Enumeration

---

Visibility settings for ReferencePoint element's coordinate reference planes.

**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public enum CoordinatePlaneVisibility
```
```vb
Public Enumeration CoordinatePlaneVisibility
```
```cpp
public enum class CoordinatePlaneVisibility
```
```fsharp
type CoordinatePlaneVisibility
```

| Member name | Value | Description |
| --- | --- | --- |
| Always | 2 | Always Visible. |
| Never | 0 | Never visible. |
| WhenSelected | 1 | Visible when selected. |

#### Reference

Autodesk.Revit.DB Namespace